import Blade from '../../assets/blade.jpg';
import Deadpool from '../../assets/Deadpool.jpg';
import DocStrange from '../../assets/doctorStrange.jpg';
import Halk from '../../assets/Halk.jpg';
import IronMan from '../../assets/ironMan.jpeg';
import Rosomaha from '../../assets/Rosomaha.jpg';
import SpiderMan from '../../assets/spiderMan.jpg';
import GhostRider from '../../assets/GhostRider.jpg';
import Comics1 from '../../assets/doctorStrange.jpg';
import Comics2 from '../../assets/spiderMan.jpg';
import Comics3 from '../../assets/irmancom.jpg';
import Comics4 from '../../assets/xman.jpg';
import Comics5 from '../../assets/doccom.jpg';
import Comics6 from '../../assets/bl1com.jpg';
import Comics7 from '../../assets/bl2com.jpg';
import Comics8 from '../../assets/blade.jpg';

export const charactersList = [
  {
    id: '0',
    Image: Blade,
    title: 'Блэйд',
    description: 'Получеловек-полувампир. Он ищет виновников своей судьбы, тех которые сделали его таким. Он ненавидит вампиров, и всячески их истребляет',
  },
  {
    id: '1',
    Image: Deadpool,
    title: 'Дэдпул',
    description: 'Опасный наёмник, имеет невероятную силу, проворство и способность к исцелению. Он грубый и весьма смешной',
  },
  {
    id: '2',
    Image: DocStrange,
    title: 'Доктор Стрендж',
    description: 'Верховный маг и главный защитник Земли от магических и мистических угроз',
  },
  {
    id: '3',
    Image: Halk,
    title: 'Халк',
    description: 'Обладает чудовищной силой и регенерацией',
  },
  {
    id: '4',
    Image: IronMan,
    title: 'Железный человек',
    description: 'Тони Старк - талантливый изобретатель. Имплантировал себе реактор возле сердца и тем самым сделал себя человеком с идеальными характеристиками',
  },
  {
    id: '5',
    Image: Rosomaha,
    title: 'Росомаха',
    description: 'Один из самых могущественных мутантов с большими когтями, кости которого состоят из особого метала, дающего мощную регенерацию',
  },
  {
    id: '6',
    Image: SpiderMan,
    title: 'Человек-паук',
    description: 'Ловкий парень, получивший способности паука',
  },
  {
    id: '7',
    Image: GhostRider,
    title: 'Призрачный гонщик',
    description: 'мотоциклист-каскадёр Джонни Блэйз, заключивший сделку с демоном Мефисто ради спасения жизни своего отца',
  }
];

export const comicsList = [
  {
    id: '0',
    Image: Comics1,
    title: 'Доктор Стрендж',
    description: 'Доктор Стивен Стрэндж, Верховный Волшебник, потерял связь с тайной силой Земли. В отчаянии...',
    fulldescription: 'Доктор Стивен Стрэндж, Верховный Волшебник, потерял связь с тайной силой Земли. В отчаянии он объединяется с Тони Старком, чтобы отправиться в космическое приключение под именем «Доктор Стрэндж: Верховный исследователь космоса». За пределами звезд Стрэндж открывает новые заклинания, союзников и врагов. Он раскрывает потаенные уголки и тайны вселенной Marvel. Но время имеет решающее значение, поскольку прошлое использование магии Стрэнджа настигло его.',
  },
  {
    id: '1',
    Image: Comics2,
    title: 'Человек-паук: Царствие 2',
    description: 'Отмеченная наградами писательница и художница Кааре Эндрюс...',
    fulldescription: 'Отмеченная наградами писательница и художница Кааре Эндрюс возвращается в мир антиутопического будущего ЧЕЛОВЕКА-ПАУКА в этом продолжении знаменательного, бросающего вызов жанрам ЧЕЛОВЕКА-ПАУКА: ЦАРСТВО! И кто новый ЧЕРНЫЙ КОШКА?! Какие трагедии и триумфы ждут этого пожилого, седого Питера Паркера? Питер не единственный, кто постарел… подождите, пока вы не увидите, что случилось с МАЙЛЗОМ МОРАЛЕСОМ!',
  },
  {
    id: '2',
    Image: Comics3,
    title: 'Железный человек Том 1',
    description: 'Комикс 1998 года, выпущенный издательством Marvel Comics, представляет собой путешествие...',
    fulldescription: 'Комикс 1998 года, выпущенный издательством Marvel Comics, представляет собой путешествие героя Железного Кулака в Хималаи, где он ищет своего наставника, одного из лучших мастеров кунг-фу - Уай Лун. По ходу пути Железный Кулак встречает множество опасностей, борется с врагами и обзаводится новыми союзниками. Он также должен противостоять коррумпированным правительственным служащим, которые злоупотребляют своей властью на местности и создают препятствия для героев.В этом комиксе Железный Кулак использует свои навыки кунг-фу и свой мощный лучевой кулак, чтобы преодолеть все препятствия на своем пути. Он также становится более уверенным в себе и лучше понимает свое место в мире, понимая, что его задача - защищать бесправных и бороться за справедливость.',
  },
  {
    id: '3',
    Image: Comics4,
    title: 'Люди Икс: Кровавая охота',
    description: 'После службы на передовой в войне против Орчиса КВАННОН наслаждается заслуженным отдыхом со своим новым возлюбленным Грейкроу. Но...',
    fulldescription: 'После службы на передовой в войне против Орчиса КВАННОН наслаждается заслуженным отдыхом со своим новым возлюбленным Грейкроу. Но когда тьма окутает Японию, ПСАЙЛОК обратит свой псионический клинок против кровососущих легендарных существ и столкнется с врагом, которого она никогда не видела. В хаосе BLOOD HUNT появляется совершенно новый злодей!',

  },
  {
    id: '4',
    Image: Comics5,
    title: 'Доктор Стрендж',
    description: 'Доктор Стивен Стрэндж, Верховный Волшебник, потерял связь с тайной силой Земли. В отчаянии...',
    fulldescription: 'Доктор Стивен Стрэндж, Верховный Волшебник, потерял связь с тайной силой Земли. В отчаянии он объединяется с Тони Старком, чтобы отправиться в космическое приключение под именем «Доктор Стрэндж: Верховный исследователь космоса». За пределами звезд Стрэндж открывает новые заклинания, союзников и врагов. Он раскрывает потаенные уголки и тайны вселенной Marvel. Но время имеет решающее значение, поскольку прошлое использование магии Стрэнджа настигло его.',

  },
  {
    id: '5',
    Image: Comics6,
    title: 'Блэйд Том 1',
    description: 'Комикс Blade vol 1 1998 года - это история, которая является оригинальным источником для фильма о Блэйде...',
    fulldescription: 'Комикс Blade vol 1 1998 года - это история, которая является оригинальным источником для фильма о Блэйде. В данном комиксе рассказывается об искусственном вампире по имени Эрик Брукс, известном как Блейд. Блэйд вместе с командой воинов-охотников за вампирами борется с Кругом, зловещей организацией вампиров, желающих захватить контроль над всеми людьми и стать правителями мира.',
  },
  {
    id: '6',
    Image: Comics7,
    title: 'Блэйд Том 2',
    description: 'История разворачивается в Нью-Йорке, где Блейд выполняет миссию помешать группе вампиров выпустить смертельный вирус, который уничтожит человечество...',
    fulldescription: 'Рассказывается о приключениях Блейда, супергероя-получеловека-полувампира, который сражается с кланом могущественных вампиров во главе со своим заклятым врагом Дракулой. История разворачивается в Нью-Йорке, где Блейд выполняет миссию помешать группе вампиров выпустить смертельный вирус, который уничтожит человечество. Столкнувшись с непреодолимыми препятствиями и численным превосходством, Блэйд должен заручиться помощью своих союзников, в том числе Ночных охотников, чтобы остановить Дракулу и его приспешников.',
  },
  {
    id: '7',
    Image: Comics8,
    title: 'Блэйд Том 3',
    description: 'Рассказывается о приключениях Блейда, супергероя-получеловека-полувампира, который...',
    fulldescription: 'Рассказывается о приключениях Блейда, супергероя-получеловека-полувампира, который сражается с кланом могущественных вампиров во главе со своим заклятым врагом Дракулой. История разворачивается в Нью-Йорке, где Блейд выполняет миссию помешать группе вампиров выпустить смертельный вирус, который уничтожит человечество. Столкнувшись с непреодолимыми препятствиями и численным превосходством, Блэйд должен заручиться помощью своих союзников, в том числе Ночных охотников, чтобы остановить Дракулу и его приспешников.',
  },
  
];

export const comicsDetailsList = [
  {
    name: 'Доктор Стрендж',
    link: 'https://batcave.biz/reader/1739/9565',
  },
  {
    name: 'Человек-паук: Царствие 2',
    link: 'https://batcave.biz/reader/32802/231550',
  },
  {
    name: 'Люди Икс: Кровавая охота',
    link: 'https://batcave.biz/reader/32804/231561',
  },
  {
    name: 'Блэйд Том 1',
    link: 'https://com-x.life/reader/7340/112022',
  },
  {
    name: 'Блэйд Том 2',
    link: 'https://com-x.life/reader/7339/389905',
  },
  {
    name: 'Блэйд Том 3',
    link: 'https://com-x.life/1726-blade-v3-read.html',
  }
];
export const characterDetailsList = [
  {
    name: 'Блэйд',
    link: 'https://www.strangearts.ru/heroes/blade-eric-brooks',
  },
  {
    name: 'Дэдпул',
    link: 'https://www.strangearts.ru/heroes/deadpool-dedpul',
  },
  {
    name: 'Доктор Стрендж',
    link: 'https://www.strangearts.ru/heroes/doctor-strange',
  },
  {
    name: 'Халк',
    link: 'https://www.strangearts.ru/heroes/hulk',
  },
  {
    name: 'Железный человек',
    link: 'https://www.strangearts.ru/heroes/iron-man-zheleznyi-chelovek',
  },
  {
    name: 'Росомаха',
    link: 'https://www.strangearts.ru/heroes/wolverine',
  },
  {
    name: 'Человек-паук',
    link: 'https://www.strangearts.ru/heroes/spider-man-peter-parker',
  },
  {
    name: 'Призрачный гонщик',
    link: 'https://www.strangearts.ru/heroes/ghost-rider',
  },
];
